---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetPropertyEnum
source: html/56f459f6-b936-9634-7d05-d5498e5087cf.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyEnum

Represents a property of material.

## Syntax (C#)
```csharp
public class AssetPropertyEnum : AssetProperty
```